# Reposition Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricationPart..::..Reposition Method
FabricationPart Class See Also
---
Repositions the fabrication straight part to another end of the run.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static void Reposition(
	Document doc,
	ElementId partId
)
```

Visual Basic
---
```text
Public Shared Sub Reposition ( _
	doc As Document, _
	partId As ElementId _
)
```

Visual C++
---
```text
public:
static void Reposition(
	Document^ doc,
	ElementId^ partId
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document.
partId
    Type: Autodesk.Revit.DB..::..ElementId Id of the fabrication part to reposition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | It is not a straight segment on the end in the run. -or- There are locked parts in the run. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | this operation failed. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace